## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.file_upload_cleanup_trigger`                    |
|        | `aws_cloudwatch_event_target.file_upload_cleanup_trigger`                  |
|        | `aws_cloudwatch_log_group.file_upload`                                     |
|        | `aws_cloudwatch_log_group.file_upload_cleanup`                             |
|        | `aws_lambda_event_source_mapping.file_upload`                              |
|        | `aws_lambda_function.file_upload`                                          |
|        | `aws_lambda_function.file_upload_cleanup`                                  |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_file_upload_cleanup_lambda` |
| update | `aws_lambda_function.submission`                                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.file_upload_cleanup_trigger will be created
  + resource "aws_cloudwatch_event_rule" "file_upload_cleanup_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every 2 hours"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "file-upload-cleanup-trigger"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "rate(2 hours)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.file_upload_cleanup_trigger will be created
  + resource "aws_cloudwatch_event_target" "file_upload_cleanup_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "file-upload-cleanup-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.file_upload will be created
  + resource "aws_cloudwatch_log_group" "file_upload" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/file-upload-processor"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.file_upload_cleanup will be created
  + resource "aws_cloudwatch_log_group" "file_upload_cleanup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/file-upload-cleanup"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_event_source_mapping.file_upload will be created
  + resource "aws_lambda_event_source_mapping" "file_upload" {
      + arn                                = (known after apply)
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = "arn:aws:sqs:ca-central-1:687401027353:file_upload_queue"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + region                             = "ca-central-1"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + uuid                               = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.file_upload will be created
  + resource "aws_lambda_function" "file_upload" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "file-upload-processor"
      + id                             = (known after apply)
      + image_uri                      = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/file-upload-processor-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = 1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "staging"
              + "REGION"      = "ca-central-1"
              + "SQS_URL"     = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_queue"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/file-upload-processor"
        }

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-06651d69cd4d3c50f",
            ]
          + subnet_ids                  = [
              + "subnet-07e38df0760d389d1",
              + "subnet-07f9debd31e48ce64",
              + "subnet-0af8e6e3cf80f582d",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.file_upload_cleanup will be created
  + resource "aws_lambda_function" "file_upload_cleanup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "file-upload-cleanup"
      + id                             = (known after apply)
      + image_uri                      = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/file-upload-cleanup-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"                             = "staging"
              + "REGION"                                  = "ca-central-1"
              + "S3_RELIABILITY_FILE_STORAGE_BUCKET_NAME" = "forms-staging-reliability-file-storage"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/file-upload-cleanup"
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ENVIRONMENT"                             = "staging"
              + "S3_RELIABILITY_FILE_STORAGE_BUCKET_NAME" = "forms-staging-reliability-file-storage"
                # (2 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_file_upload_cleanup_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_file_upload_cleanup_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "file-upload-cleanup"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + lambda_file_upload_cleanup_log_group_name      = "/aws/lambda/file-upload-cleanup"
  + lambda_file_upload_processor_log_group_name    = "/aws/lambda/file-upload-processor"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.file_upload_cleanup_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload_cleanup"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing...
```

</details>
